#pragma once
#include <iostream>

class BasicClass
{
	char choose;
	int arr_sigma[2][8];
public:
	BasicClass()
	{
		for (int j = 0; j < 8; j++)
			arr_sigma[0][j] = j + 1;

		for (int i = 0; i < 2; i++)
		{
			for (int j = 0; j < 8; j++)
				std::cout << arr_sigma[i][j] << " ";
			std::cout << std::endl;
		}
	}

	void show_menu()
	{
		std::cout << "\n===========================================\n";
		std::cout << "Нажмите 1 для проведения следующих расчётов: \n*Произведения циклов сигмы в виде, аналогичном тета\n"
			<< "*Произведение сигмы*тета и тета*сигму\n*Обратная сигма\n";
		std::cout << "-------------------------------------------\n";
		std::cout << "Нажмите 2 для проведения следующих расчётов: \n*Составление таблицы инверсий перестановки тета"
			<< "*Определение четности перестановки\n";
		std::cout << "-------------------------------------------\n";
		std::cout << "Нажмите 3 для восстановления перестановки по таблице инверсий\n";
		std::cout << "Нажмите e(ENG) для выхода\n";
		std::cout << "===========================================\n";
		std::cout << "Ваш ответ: ";
		std::cin >> choose;
		while (choose != '1' && choose != '2' && choose != '3' && choose != 'e')
		{
			std::cout << "Введите '1','2','3' или 'e'(ENG), в зависимости от задачи:";
			std::cin >> choose;
		}
	}
};